export const exifTags = {
  // "0th" (Հիմնական տվյալներ)
  author: 315, // Հեղինակը (նկարիչը կամ ստեղծողը)
  description: 270, // Նկարի նկարագրություն (նկարի մասին տեքստ)
  phone: 271, // Հեռախոսի ապրանքանիշ (օրինակ՝ Canon, Nikon)
  phoneModel: 272, // Հեռախոսի մոդել (օրինակ՝ EOS 5D)
  dateTime: 306, // Նկարահանման ամսաթիվ և ժամ (օրինակ՝ 2023:01:15 12:00:00)
  softWare: 305, // Ծրագրակազմ (օգտագործված ծրագիրը, օրինակ՝ Photoshop)
  copyRight: 33432, // Հեղինակային իրավունք (օրինակ՝ © 2023 Անուն)
  orientation: 274, // Կողմնորոշում (նկարի դիրքը՝ հորիզոնական, ուղղահայաց)
  xResolution: 282, // X լուծաչափ (պիքսելներ մեկ միավորի համար X առանցքում)
  yResolution: 283, // Y լուծաչափ (պիքսելներ մեկ միավորի համար Y առանցքում)
  resolutionUnit: 296, // Լուծաչափի միավոր (օրինակ՝ դյույմ կամ սանտիմետր)

  // "Exif" (Ընդլայնված տվյալներ)
  userComment: 37510, // Օգտագործողի մեկնաբանություն (անձնական նշումներ)
  exposureTime: 33434, // Լուսավորման ժամանակ (օրինակ՝ 1/60 վայրկյան)
  fNumber: 33437, // Դիաֆրագմայի թիվ (օրինակ՝ f/2.8)
  isoSpeedRatings: 34855, // ISO զգայունություն (օրինակ՝ ISO 100)
  dateTimeOriginal: 36867, // Օրիգինալ ամսաթիվ և ժամ (նկարի ստեղծման ժամանակը)
  dateTimeDigitized: 36868, // Թվայնացման ամսաթիվ և ժամ (երբ նկարը թվայնացվել է)
  shutterSpeedValue: 37377, // Փակիչի արագություն (օրինակ՝ 1/125 վայրկյան)
  apertureValue: 37378, // Դիաֆրագմայի արժեք (APEX միավորներով)
  brightnessValue: 37379, // Պայծառության արժեք (լույսի մակարդակը)
  exposureBiasValue: 37380, // Լուսավորման կողմնակալություն (օրինակ՝ +0.3 EV)
  meteringMode: 37383, // Չափման ռեժիմ (օրինակ՝ կենտրոնական, բազմակետ)
  flash: 37385, // Ֆլեշ (օգտագործվե՞լ է, թե՝ ոչ)
  focalLength: 37386, // Ֆոկուսային հեռավորություն (օրինակ՝ 50mm)
  exifVersion: 36864, // EXIF տարբերակ (օրինակ՝ 0230)

  // "GPS" (Գեոտեղորոշման տվյալներ)
  gpsN: 2, // Լայնություն (Latitude, օրինակ՝ 40.7128° N)
  gpsE: 4, // Երկայնություն (Longitude, օրինակ՝ 74.0060° W)
  gpsAltitude: 6, // Բարձրություն ծովի մակարդակից (օրինակ՝ 100 մ)
  gpsTimeStamp: 7, // GPS ժամանակ (նկարահանման ժամը GPS-ով)
  gpsDateStamp: 29, // GPS ամսաթիվ (օրինակ՝ 2023:01:15)
  location: function (gpsN, gpsE) {
    if (!gpsN && !gpsE) return err;
    let latD = gpsN[0][0] / gpsN[0][1] || 0;
    let latM = gpsN[1][0] / gpsN[1][1] || 0;
    let latS = gpsN[2][0] / gpsN[2][1] || 0;

    let lonD = gpsE[0][0] / gpsE[0][1] || 0;
    let lonM = gpsE[1][0] / gpsE[1][1] || 0;
    let lonS = gpsE[2][0] / gpsE[2][1] || 0;

    let lat = latD + latM / 60 + latS / 3600;
    let lon = lonD + lonM / 60 + lonS / 3600;
    if (!isNaN(lat) && !isNaN(lon)) {
      return `${lat.toFixed(6)}, ${lon.toFixed(6)}`;
    }
  },
};
